//#include <iostream>
//
//using namespace std;
//typedef long long ll;
//int main()
//{
//    int t; cin >> t;
//    while (t--)
//    {
//        //首先有个数组
//        //d是最大的除数, 然后调换 下标是d 和 下标是k 的两个数
//        //先全部处理一遍, 然后再遍历找到1在哪里
//        //1在什么时候回来动?, 当
//        int n; cin >> n;
//        //cin >> n;
//        for (ll i = 1; i < 2e9; i <<= 1)
//        {
//            if (n < i)
//            {
//                cout << (i >>= 1) << endl;
//                break;
//            }
//        }
//    }
//    //ll n = 1 << 30;
//    //    for (ll i = 1; i <= n; i <<= 1)
//    //    {
//    //        if (n < i)
//    //        {
//    //            cout << (i >>= 1) << endl;
//    //            break;
//    //        }
//    //    }
//    return 0;
//}




//30
//1
//2
//4
//8
//16
//32
//64
//128
//256
//512
//1024
//2048
//4096
//8192
//16384
//32768
//65536
//131072
//262144
//524288
//1048576
//2097152
//4194304
//8388608
//16777216
//33554432
//67108864
//134217728
//268435456
//536870912
